# SelectionChangedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionChangedEventArgs Class
Members See Also
---
The event arguments used by the SelectionChanged event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class SelectionChangedEventArgs : RevitAPISingleEventArgs
```

Visual Basic
---
```text
Public Class SelectionChangedEventArgs _
	Inherits RevitAPISingleEventArgs
```

Visual C++
---
```text
public ref class SelectionChangedEventArgs : public RevitAPISingleEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.UI.Events..::..SelectionChangedEventArgs
# See Also
SelectionChangedEventArgs Members
Autodesk.Revit.UI.Events Namespace